In [1]:
import numpy as np
import pandas as pd

In [2]:
area = pd.Series([3,4,5,6], index = [4,5,6,0])

In [3]:
area

4    3
5    4
6    5
0    6
dtype: int64

In [4]:
area = {"amy": 22, "carlos": 23, "danny": 45, "frank": 50}

In [5]:
area_series = pd.Series(area)

In [6]:
area_series

amy       22
carlos    23
danny     45
frank     50
dtype: int64

In [7]:
sex = {"amy": "M", "carlos": "M", "danny": "F", "frank": "F"}
sex_series = pd.Series(sex)

In [8]:
sex_series

amy       M
carlos    M
danny     F
frank     F
dtype: object

In [9]:
df = pd.DataFrame({"age": area_series, "sex": sex_series})

In [10]:
df

        age sex
amy      22   M
carlos   23   M
danny    45   F
frank    50   F

In [18]:
df.iloc[1:3,:]

        age sex
carlos   23   M
danny    45   F

In [19]:
df.age.iloc[3]

50

In [20]:
df.loc['amy'].age

22

In [21]:
df.index

Index(['amy', 'carlos', 'danny', 'frank'], dtype='object')

In [68]:
l1 = [3,4,5,6]
l2 = [1,2,34,99]

In [23]:
df_1 = pd.DataFrame({"l1": l1, "l2": l2})

In [24]:
df_1

   l1  l2
0   3   1
1   4   2
2   5  34
3   6  99

In [29]:
df_2 = pd.DataFrame([l1,l2], columns = ['l1', 'l2', 'l3', 'l4'])

In [27]:
df_2

   l1  l2  l3  l4
0   3   4   5   6
1   1   2  34  99

In [30]:
d = [['jack', 45, 'ds'], ['juan', 67, 'ms'], ['preethi', 23, 'ID']]

In [31]:
pd.DataFrame(d, columns = ['a', 'b', 'c'])

         a   b   c
0     jack  45  ds
1     juan  67  ms
2  preethi  23  ID

In [69]:
tup = list(zip(l1,l2))
typ_df = pd.DataFrame(tup)

In [34]:
l_tup = [('jack', 45, 'm'), ('rashi', 34, 'f'), ('kiru', 25, 'f')]
pd.DataFrame(l_tup)

       0   1  2
0   jack  45  m
1  rashi  34  f
2   kiru  25  f

In [38]:
l1

[3, 4, 5, 6]

In [46]:
l1[::-3]

[6, 3]

In [119]:
df = pd.read_csv("~/Desktop/python-codes/data/cast.csv")

In [48]:
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [49]:
l1 = ['Steve Jobs']

In [51]:
df.title is l1

False

In [55]:
df[df.year == 2015].title.head()

0            Closet Monster
3      Secret in Their Eyes
4                Steve Jobs
5    Straight Outta Compton
6    Straight Outta Compton
Name: title, dtype: object

In [58]:
df.loc[df.year == 2015, ['title', 'character']].head()

                    title                character
0          Closet Monster                  Buffy 4
3    Secret in Their Eyes          2002 Dodger Fan
4              Steve Jobs  1988 Opera House Patron
5  Straight Outta Compton              Club Patron
6  Straight Outta Compton                  Dopeman

In [61]:
df.n.sum()

774049.0

In [113]:
typ_df

   0   1  val
0  3   1  4.0
1  4   2  5.0
2  5  34  6.0
3  6  99  5.0

In [114]:
val = [4,5,6, np.nan]

In [115]:
typ_df['val'] = val

In [116]:
typ_df

   0   1  val
0  3   1  4.0
1  4   2  5.0
2  5  34  6.0
3  6  99  NaN

In [117]:
typ_df.iloc[1,2] = np.nan

In [85]:
typ_df.fillna(typ_df.mean())

   0   1  val
0  3   1  4.0
1  4   2  5.0
2  5  34  6.0
3  6  99  5.0

In [92]:
typ_df.val.fillna(typ_df.val.mean(), inplace = True)

In [86]:
typ_df

   0   1  val
0  3   1  4.0
1  4   2  NaN
2  5  34  6.0
3  6  99  NaN

In [87]:
typ_df.dropna()

   0   1  val
0  3   1  4.0
2  5  34  6.0

In [89]:
typ_df.isnull().sum()

0      0
1      0
val    2
dtype: int64

In [90]:
typ_df.notnull().sum()

0      4
1      4
val    2
dtype: int64

In [91]:
typ_df.dropna(axis = 1)

   0   1
0  3   1
1  4   2
2  5  34
3  6  99

In [93]:
typ_df.mean(axis = 1)

0     2.666667
1     3.666667
2    15.000000
3    36.666667
dtype: float64

In [95]:
typ_df.mean().sum()

43.5

In [102]:
df1 = pd.DataFrame({"A": [2,3,4,6], "B": [2,3,4,5]})
df2 = pd.DataFrame({"D": [3,4,5,6], "C": [1,2,3,4]})

In [103]:
pd.concat([df1,df2])

/Users/kiru/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D
0  2.0  2.0  NaN  NaN
1  3.0  3.0  NaN  NaN
2  4.0  4.0  NaN  NaN
3  6.0  5.0  NaN  NaN
0  NaN  NaN  1.0  3.0
1  NaN  NaN  2.0  4.0
2  NaN  NaN  3.0  5.0
3  NaN  NaN  4.0  6.0

In [104]:
pd.concat([df1,df2], axis = 1)

   A  B  D  C
0  2  2  3  1
1  3  3  4  2
2  4  4  5  3
3  6  5  6  4

In [105]:
df1.join(df2)

   A  B  D  C
0  2  2  3  1
1  3  3  4  2
2  4  4  5  3
3  6  5  6  4

In [106]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [109]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [110]:
# merge - database style merge - can give key on merge - on, left_on, right_on
# append - rbind
# concat - default rbind, if specified does cbind
# join - column bind

In [112]:
df1.drop(['group'], axis = 1)

  employee
0      Bob
1     Jake
2     Lisa
3      Sue

In [118]:
typ_df.isnull().any()

0      False
1      False
val     True
dtype: bool

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75001 entries, 0 to 75000
Data columns (total 6 columns):
title        75001 non-null object
year         75001 non-null int64
name         75001 non-null object
type         75001 non-null object
character    75001 non-null object
n            46035 non-null float64
dtypes: float64(1), int64(1), object(4)
memory usage: 3.4+ MB

In [122]:
df.query('year == 2015 & n > 4').head()

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
11,Little Angel (Angelita),2015,Michael 'babeepower' Viera,actor,Chico,9.0
35,They Want Dick Dickster,2015,Zhavier' (II) 'Fox,actor,Dr. Shrinkalotsky,25.0
49,Using,2015,Johnny 'Koolout' Starks,actor,Randall Dawson,10.0
57,Jenny's Wedding,2015,Hildy 'McGillicuddy' Johnson,actor,Mickey the Dog,26.0

In [127]:
df.sort_values(['year'], ascending = [False]).head()

,title,year,name,type,character,n
63301,Inside Me,2023,Victoria Alcala,actress,Loretta,NaN
63300,Inside Me,2023,Victoria Alcala,actress,Rosa,NaN
28874,Inside Me,2023,Antonio Alcala,actor,Max,NaN
35687,Roses in the Concrete,2020,Darren Alford,actor,Seth,NaN
24732,Nostradamus Mission 3: Alien Invasion,2020,Misan Akuya,actor,Anunnaki warrior,NaN

In [128]:
import seaborn as sns

In [129]:
planets = sns.load_dataset('planets')

In [130]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [131]:
planets.groupby(['method'])['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [134]:
planets.groupby(['method'])['orbital_period'].aggregate({'minx': 'min', 'meanx': 'mean'})

/Users/kiru/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

                                      minx          meanx
method
Astrometry                      246.360000     631.180000
Eclipse Timing Variations      1916.250000    4751.644444
Imaging                        4639.150000  118247.737500
Microlensing                   1825.000000    3153.571429
Orbital Brightness Modulation     0.240104       0.709307
Pulsar Timing                     0.090706    7343.021201
Pulsation Timing Variations    1170.000000    1170.000000
Radial Velocity                   0.736540     823.354680
Transit                           0.355000      21.102073
Transit Timing Variations        22.339500      79.783500

In [139]:
df.title.apply(lambda x: str(x + " hi")).head()

0          Closet Monster hi
1         Suuri illusioni hi
2     Battle of the Sexes hi
3    Secret in Their Eyes hi
4              Steve Jobs hi
Name: title, dtype: object

In [141]:
df.title.transform(lambda x: str(x + " hi")).head()

0          Closet Monster hi
1         Suuri illusioni hi
2     Battle of the Sexes hi
3    Secret in Their Eyes hi
4              Steve Jobs hi
Name: title, dtype: object

In [143]:
df.title.map(lambda x: str(x+ " hi")).head()

0          Closet Monster hi
1         Suuri illusioni hi
2     Battle of the Sexes hi
3    Secret in Their Eyes hi
4              Steve Jobs hi
Name: title, dtype: object

In [145]:
df.applymap(lambda x: str(x) + " hi").head()

,title,year,name,type,character,n
0,Closet Monster hi,2015 hi,Buffy #1 hi,actor hi,Buffy 4 hi,31.0 hi
1,Suuri illusioni hi,1985 hi,Homo $ hi,actor hi,Guests hi,22.0 hi
2,Battle of the Sexes hi,2017 hi,$hutter hi,actor hi,Bobby Riggs Fan hi,10.0 hi
3,Secret in Their Eyes hi,2015 hi,$hutter hi,actor hi,2002 Dodger Fan hi,nan hi
4,Steve Jobs hi,2015 hi,$hutter hi,actor hi,1988 Opera House Patron hi,nan hi

In [146]:
# creating a dataframe 
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 27, 1: 23, 2: 21}})

In [147]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [148]:
pd.melt(df, id_vars = ['Name'], value_vars = ['Course'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate

In [150]:
pd.melt(df, id_vars = ['Name'], value_vars = ['Age', 'Course'], var_name = "var_name", value_name = "value_name")

     Name var_name value_name
0    John      Age         27
1     Bob      Age         23
2  Shiela      Age         21
3    John   Course    Masters
4     Bob   Course   Graduate
5  Shiela   Course   Graduate

In [151]:
df1 = pd.DataFrame({'Name': ['AMy', 'Danny', 'Linda', "shae"], '2015': [23,23,45,66], '2016': [12,12,22,22]})

In [152]:
df1

    Name  2015  2016
0    AMy    23    12
1  Danny    23    12
2  Linda    45    22
3   shae    66    22

In [153]:
pd.melt(df1, id_vars = ['Name'], value_vars = ['2015', '2016'], var_name = "year", value_name = "age")

    Name  year  age
0    AMy  2015   23
1  Danny  2015   23
2  Linda  2015   45
3   shae  2015   66
4    AMy  2016   12
5  Danny  2016   12
6  Linda  2016   22
7   shae  2016   22

In [154]:
titanic = sns.load_dataset('titanic')

In [158]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [163]:
titanic.pivot_table(['survived'], index = ['sex', 'alone'], columns = ['class', 'alive'])

             survived
class           First     Second     Third
alive              no yes     no yes    no yes
sex    alone
female False        0   1      0   1     0   1
       True         0   1      0   1     0   1
male   False        0   1      0   1     0   1
       True         0   1      0   1     0   1

In [166]:
titanic.pivot_table(['fare'], index = ['sex'], columns = ['class', 'alive'], aggfunc= ['mean', 'sum'])

              mean                                                          \
              fare
class        First                 Second                 Third
alive           no         yes         no        yes         no        yes
sex
female  110.604167  105.978159  18.250000  22.288989  19.773093  12.464526
male     62.894910   74.637320  19.488965  21.095100  12.204469  15.579696

              sum
             fare
class       First                Second                 Third
alive          no        yes         no        yes         no       yes
sex
female   331.8125  9644.0125   109.5000  1560.2292  1423.6627  897.4459
male    4842.9081  3358.6794  1773.4958   358.6167  3661.3408  732.2457

In [169]:
titanic['new_var'] = titanic['sex'].str.cat(titanic['sex'], sep = "/")

In [174]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_var,new_1,new_2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male/male,male,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female/female,female,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female/female,female,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female/female,female,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male/male,male,male

In [173]:
titanic[['new_1', 'new_2']] = titanic['new_var'].str.split('/', expand = True)